Request.xml

<?xml version="1.0" encoding="utf-16"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Read xmlns="urn:microsoft-dynamics-schemas/page/wscustomerapi">
      <No>10000</No>
    </Read>
  </soap:Body>
</soap:Envelope>